AndyAiCardputer/crowpanel-esp32p4-projects/crown_nes/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"

# PSRAM (CRITICAL for display framebuffer + NES ROM loading)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y

# LVGL fonts (for file browser UI)
CONFIG_LV_FONT_MONTSERRAT_42=y
CONFIG_LV_FONT_MONTSERRAT_20=y

# Performance
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_FREERTOS_HZ=1000

# Watchdog (needed by nofrendo NES core, timeout set long)
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30

# Console on UART1 (J2 connector: GPIO47=TX, GPIO48=RX)
CONFIG_ESP_CONSOLE_UART_CUSTOM=y
CONFIG_ESP_CONSOLE_UART_NUM=1
CONFIG_ESP_CONSOLE_UART_TX_GPIO=47
CONFIG_ESP_CONSOLE_UART_RX_GPIO=48
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200

# USB Host
CONFIG_USB_HOST_CONTROL_TRANSFER_MAX_SIZE=256
CONFIG_USB_HOST_HW_BUFFER_BIAS_BALANCED=y
CONFIG_USB_HOST_DEBOUNCE_DELAY_MS=250

# USB Hub support (for Steam Deck Dock / powered hubs)
CONFIG_USB_HOST_HUBS_SUPPORTED=y
CONFIG_USB_HOST_HUB_MULTI_LEVEL=y
